{
  "last_updated": "2024-04-01T12:29:25+00:00",
  "activity": [
    {
      "type": "comment_created",
      "title": "coronasafe/leaderboard#212",
      "time": "2024-04-01T12:29:25+00:00",
      "link": "https://github.com/coronasafe/leaderboard/issues/212#issuecomment-2029683506",
      "text": "> @ankitmrj did you mean [coronasafe/care_fe#7425](https://github.com/coronasafe/care_fe/issues/7425) instead?\r\nYes sir\r\n I have complete my proposal can you please review ?\r\n"
    },
    {
      "type": "comment_created",
      "title": "coronasafe/care_fe#7510",
      "time": "2024-04-01T12:22:15+00:00",
      "link": "https://github.com/coronasafe/care_fe/issues/7510#issuecomment-2029675683",
      "text": "Hi @rithviknishad @NNSiri \r\nFeature Request: Enhanced Filtering for Users\r\n\r\nProblem Statement: Currently, in the Users section under Advanced Filters, there is no option to select specific Talukas, which limits our ability to efficiently manage and scale operations across Taluka Hospitals in Karnataka.\r\n\r\nProposed Solution: We request the implementation of a feature that allows users to filter based on Taluka. This would greatly benefit our organization as we expand our presence and operations within Karnataka.\r\n\r\nBenefits:\r\n\r\nEfficiency: Enables us to quickly identify and manage users associated with specific Talukas.\r\nScalability: Supports our growth strategy by facilitating management across multiple Taluka Hospitals.\r\nAccuracy: Ensures precise user targeting and management within designated geographic areas.\r\nAlternative Consideration: While we await this feature implementation, a temporary workaround could involve manually sorting and categorizing users based on Taluka information provided in their profiles. However, this manual approach is time-consuming and prone to errors, highlighting the necessity of an automated filtering feature.\r\n\r\nThank you for considering my feature request. I believe that this enhancement will significantly improve our workflow and contribute to the overall effectiveness of the platform.\r\n\r\n"
    },
    {
      "type": "comment_created",
      "title": "coronasafe/care_fe#7382",
      "time": "2024-04-01T01:33:21+00:00",
      "link": "https://github.com/coronasafe/care_fe/issues/7382#issuecomment-2029007311",
      "text": "@rithviknishad sir if issue is still not resolved, can I work on it?\r\n"
    },
    {
      "type": "comment_created",
      "title": "coronasafe/leaderboard#212",
      "time": "2024-03-20T20:29:01+00:00",
      "link": "https://github.com/coronasafe/leaderboard/issues/212#issuecomment-2010566151",
      "text": "Greetings,\r\nRespected Sir ,\r\n\r\nI am first year undergraduate student, of Computer Science at State University from India. I am thrilled to work on project \" Integrating OHIF Viewer for DICOM Imaging within CARE's Frontend with S3-based File Management\".\r\n\r\nPlease help me to learn and contribute more idea to this project.\r\n\r\nHow to get template for proposal ?.\r\nThanking You !\r\n"
    }
  ],
  "open_prs": [],
  "authored_issue_and_pr": []
}