{
  "last_updated": "2025-04-08T05:22:18.000Z",
  "activity": [
    {
      "type": "comment_created",
      "title": "ohcnetwork/care_fe#10599",
      "time": "2025-04-08T05:22:18.000Z",
      "link": "https://github.com/ohcnetwork/care_fe/issues/10599#issuecomment-2785254131",
      "text": "Hello @shivankacker , @rithviknishad , @tellmeY18 \n\nI'm Dhanashri Patil, currently in my third year of B.Tech in Artificial Intelligence and Machine Learning. I'm deeply interested in backend and full-stack development, and I'm always looking to work on projects that create real-world impact—especially in healthcare.\n\nWhile going through the GSoC 2025 ideas, the WhatsApp Bot for CARE project really stood out to me. The concept of making healthcare more accessible through something as familiar as instant messaging feels like a smart, meaningful step forward. It’s not just tech—it’s tech with purpose.\n\nI’ve worked with Python, Django, and RESTful APIs, and I enjoy building backend systems that are clean, efficient, and secure. I’ve also been involved in projects that included chat-based interfaces, which makes this idea particularly exciting for me.\n\n**Here’s how I’m planning to contribute:**\n\n1. First, I want to thoroughly understand how CARE functions—especially how data flows between patients, staff, and systems.\n\n2. I aim to help in building a modular and scalable IM wrapper that can support different messaging services.\n\n3. I’m also interested in working on the actual WhatsApp bot.\n\n4. Testing and refining the bot experience will also be part of my focus.\n\nI’ve started exploring the codebase and the platform. I’m also preparing a proposal for this project and would love to get suggestions or feedback from the mentors and the community.\n\nReally excited to be here and to contribute to something so valuable! 😊\n\nBest,\nDhanashri Patil\n\n📧 patil.dhanashrik@gmail.com\n🔗 [GitHub](https://github.com/DhanashriPatil11) | [LinkedIn](https://www.linkedin.com/in/dhanashri-patil24/)\n\n\n\n\n\n\n\n\n\n"
    },
    {
      "type": "comment_created",
      "title": "ohcnetwork/care_fe#10599",
      "time": "2025-04-08T05:13:06.000Z",
      "link": "https://github.com/ohcnetwork/care_fe/issues/10599#issuecomment-2785242812",
      "text": "Hello @shivankacker, @rithviknishad, @tellmeY18,\n"
    }
  ],
  "open_prs": [],
  "authored_issue_and_pr": []
}