{
  "last_updated": "2024-03-31T10:38:21+00:00",
  "activity": [
    {
      "type": "comment_created",
      "title": "coronasafe/care_fe#6715",
      "time": "2024-03-31T10:38:21+00:00",
      "link": "https://github.com/coronasafe/care_fe/issues/6715#issuecomment-2028634579",
      "text": "## Hey there!👋 \r\n\r\nI'm Divyam and I'm excited about the opportunity to contribute to this project, especially through GSoC. I've attached my project proposal on the GSoC website and I'm thrilled about the prospect of working on enhancing the security with Two-Factor Authentication (2FA) in the CARE system. This aligns perfectly with my interests and skills.\r\n\r\nFrom what I understand, users will initially input their username and password on the login page. After the backend server verifies these credentials successfully, a request is triggered to the 2FA service for generating a Time-Based One-Time Password (TOTP) code. Subsequently, this code is transmitted to the user, who then inputs it on the login page. Once received, the backend server proceeds to validate the TOTP code and authenticate the user, subsequently redirecting them to the dashboard upon successful authentication.\r\n\r\nI have experience in web development, particularly with ReactJS and Django. In previous projects, I've successfully implemented 2FA mechanisms using libraries like pyotp for TOTP generation and verification, as well as bcryptjs for user authentication. Additionally, I'll be a Globalink Research Intern at MITACS this summer in which I will be working on a similar project, which will complement my contributions to this project. I'm eager to learn more about the project and discuss how I can contribute effectively. Thank you for considering my application.\r\n\r\nYou can reach me at divyammalik2003@gmail.com and find my GitHub profile [here](https://github.com/divyam6969). \r\n\r\nBest regards,\r\nDivyam\r\n\r\n<img width=\"500\" alt=\"image\" src=\"https://github.com/coronasafe/care_fe/assets/86784749/60ab5fe6-0230-4a51-a871-f12f970a3606\">\r\n\r\n"
    }
  ],
  "open_prs": [],
  "authored_issue_and_pr": []
}