{
  "last_updated": "2025-04-04T11:17:13.000Z",
  "activity": [
    {
      "type": "comment_created",
      "title": "ohcnetwork/care_fe#11718",
      "time": "2025-04-04T11:17:13.000Z",
      "link": "https://github.com/ohcnetwork/care_fe/issues/11718#issuecomment-2778389345",
      "text": "Describe your solution clearly:\nI will add a table skeleton loader using the existing UI components (e.g., Material UI, Tailwind, or custom styling) to show while the Appointments List is loading. This loader will maintain layout consistency and improve user experience. Additionally, I’ll replace the current static empty state with a more informative and user-friendly empty state — including an icon, message, and optional CTA (e.g., \"Book your first appointment\").\n\nExpected Timeline:\nEnd date: April 7, 2025\n\nAdditional Context:\nNo new dependencies are needed. This enhancement is focused on improving the UI/UX and can be implemented using the current component structure. Will ensure it's mobile-responsive and accessible.\nplease assign me this work"
    },
    {
      "type": "comment_created",
      "title": "ohcnetwork/care_fe#11702",
      "time": "2025-04-03T11:25:10.000Z",
      "link": "https://github.com/ohcnetwork/care_fe/issues/11702#issuecomment-2775448480",
      "text": "Hi ashwinpraveengo, would like to work on this issue.\n\nProposed Solution:\nResponsive Design Fixes\n\nEnsure the PDF viewer container uses flexbox or grid for proper scaling on mobile screens.\n\nUse CSS media queries to adjust width, height, and positioning of zoom controls and navigation buttons for smaller screens.\n\nError Handling Improvement\n\nDebug why the \"Failed to load PDF file\" error occurs on mobile.\n\nEnsure the PDF.js library (or any viewer being used) properly loads files on mobile.\n\nTest different rendering methods like object/embed/iframe to check for compatibility issues.\n\nTouch-Friendly Controls\n\nIncrease button size for zoom and navigation controls for better mobile usability.\n\nAdd swipe gestures for navigation between pages if applicable.\n\nExpected Timeline:\nEnd date: April 5, 2025\n\nAdditional Context:\nI will test the fixes on multiple mobile devices, including Samsung Galaxy M34 (Android) and other screen sizes.\n\nIf needed, I will integrate a mobile-responsive PDF viewer library for better adaptability.\n\nPlease assign me this issue, and I will provide updates as I make progress.\n\nThanks!\n\n"
    },
    {
      "type": "comment_created",
      "title": "ohcnetwork/care_fe#11607",
      "time": "2025-04-02T10:54:45.000Z",
      "link": "https://github.com/ohcnetwork/care_fe/issues/11607#issuecomment-2772191265",
      "text": "sir in website where this kind of date picker is present is it present in stafflogin or patient login or can you share the link of that"
    }
  ],
  "open_prs": [],
  "authored_issue_and_pr": []
}