{
  "last_updated": "2024-03-26T09:49:58+00:00",
  "activity": [
    {
      "type": "comment_created",
      "title": "coronasafe/care_fe#7159",
      "time": "2024-03-26T09:49:58+00:00",
      "link": "https://github.com/coronasafe/care_fe/issues/7159#issuecomment-2019971320",
      "text": "Hello everyone, I am Harshit Raj Pandey, an undergraduate computer science student at Guru Gobind Singh Indraprastha University, enrolled in B.Tech (Computer Science and Engineering), currently in 2nd semester, here are some of my details:\r\n\r\nTime Zone: IST\r\nContact Info:   Phone no. : +91 9810180956      ,     Email ID: hrpofficial736@gmail.com\r\nGithub Profile:    https://github.com/hrpofficial736    \r\nLinkedIn Profile:  https://www.linkedin.com/in/harshit-raj-pandey-661892275/\r\n\r\nI am excited to work on the following project:\r\n\r\nProject Name:  'Enhance the Doctor Notes Feature in the Patient Consultation Page'\r\n\r\nProject Description:  The doctor notes feature is an essential component of any healthcare management system, facilitating effective communication and documentation between healthcare providers and patients. However, there is often room for improvement in terms of functionality, usability, and accessibility. This project seeks to address these shortcomings by implementing enhancements to the doctor notes feature.\r\n\r\nFeatures: \r\n\r\n 1. File Upload Option: Implement an option to upload files to doctor notes.\r\n 2. Markdown Support: Add markdown support to doctor notes for formatting.\r\n 3. Write Note to Specific File: Introduce functionality to write notes to a specific file.\r\n 4. User Tagging Mechanism: Implement a mechanism to tag specific users in doctor notes for communication purposes.\r\n 5. Improved User Interface: Enhance the user interface of the doctor notes feature to make it more intuitive and user-friendly.\r\n\r\n\r\nSkills: Next JS, React JS, Node JS, Express JS, Tailwind CSS, Mongo DB, and proficient in Javascript programming language.\r\n\r\nProjects: Some of my projects are listed below:\r\n\r\n\t  1. Vaayu Check (an AQI monitoring application, made with MERN stack)\r\n          2. Sangeet (a Spotify-inspired music app, made with the help of Next JS )\r\n          3. Basic railway reservation system inspired from Indian Railways reservation system (MERN stack)\r\n\r\n\r\n\r\nTimeline:\r\n\r\nWeek 1-2: Project setup and familiarization with existing codebase.\r\nWeek 3-4: Designing the user interface and planning feature enhancements.\r\nWeek 5-8: Implementing rich text formatting, attachment support, and version control.\r\nWeek 9-10: Adding search and filter functionality.\r\nWeek 11-12: Integration testing, bug fixing, and documentation.\r\n\r\nA brief summary about me:\r\n\r\nAs an aspiring MERN stack developer, I thrive on the opportunity to create innovative solutions and explore the endless possibilities of technology. I am always eager to tackle new challenges and driven by my enthusiasm for building cutting-edge applications. Skilled in Web Development with proficiency in Next.js, React.js, Tailwind CSS, Node.js, Express.js, and Mongo DB, I am well-equipped to tackle complex projects and deliver exceptional results. With a relentless commitment to learning and growth, I am looking forward to make a meaningful impact in the world of software development. My motivation for applying to work on enhancing the doctor notes feature in the patient consultation page stems from my unwavering belief in the transformative power of technology to improve healthcare delivery. Having closely observed the complexities and inefficiencies in existing healthcare management systems, I am compelled to contribute my expertise towards building solutions that enhance the quality of care and streamline healthcare workflows. With meticulous attention to detail and a commitment to excellence, I am dedicated to delivering tangible results that not only meet but exceed the project objectives. I am excited about the opportunity to collaborate with the team and make meaningful contributions toward advancing healthcare technology for the betterment of society.\r\n\r\nAvailability:  \r\n\r\nNumber of hours per week I can dedicate:  18 hours\r\n\r\nAs I am currently in my second semester, during the project period, I will be sometimes engaged in classes and also I'll be having mid-term exams from 1st week of April. But I think I'll be able to allocate the mentioned no. of hours to the project and I'll be glad to make any contribution to this project and learn many cool things throughout this journey.\r\n\r\n\r\nLooking forward to work with all of you and to learn some cool stuff this summer!\r\nFeel free to reach out to me anytime at your earliest convenience.\r\nThank you..."
    }
  ],
  "open_prs": [],
  "authored_issue_and_pr": []
}