{
  "last_updated": "2024-03-26T20:33:43+00:00",
  "activity": [
    {
      "type": "comment_created",
      "title": "coronasafe/care#1338",
      "time": "2024-03-26T20:33:43+00:00",
      "link": "https://github.com/coronasafe/care/issues/1338#issuecomment-2021417205",
      "text": "Hi @sainak,\r\n\r\nI would like to contribute to the project by addressing the Fix N+1 queries issue (#1338) in the /api/v1/bed/ endpoint. Could I please be assigned to work on this task? I believe I can help optimize the queries and improve performance in this area.\r\n\r\nThank you,\r\nJason Xie"
    },
    {
      "type": "comment_created",
      "title": "coronasafe/care#1977",
      "time": "2024-03-24T18:56:27+00:00",
      "link": "https://github.com/coronasafe/care/issues/1977#issuecomment-2016905636",
      "text": "Hello,\r\nMy name is Xiaoyang (Jason) Xie, and I am a Master student currently at University of Toronto studying computer engineering, and undergraduate studies in computer science at Western Univeristy. I am excited about the opportunity to contribute to the Whatsapp bot for CARE for Open HealthCare Network.\r\n\r\nHaving focused my studies on algorithms, full-stack development and other software engineering skills, I am particularly interested in contributing to projects that involve the implementation of healthcare technology and its potential to transform patient care. I believe my background and skills align well with several aspects of this topic, including:\r\n\r\n1. Proficiency in Java and Python for backend development, automation, and data processing tasks.\r\n2. Experience with frameworks like flask, Spring Boot, Hibernate, and Robot Framework for building robust backend services, database operations, and automated testing.\r\n3. Familiarity with Docker, Jenkins, and Agile methodologies for efficient deployment, continuous integration, and responsive project management.\r\n\r\nI am committed to delivering a functional and user-centric GUI for the robust data handling capabilities, and interactive visualization tools. I look forward to collaborating with the team to achieve our goals and make impactful contributions to the project.\r\n\r\nThank you for considering my candidacy, and I am eager to contribute my skills and expertise to this exciting endeavor.\r\nJason Xie\r\nxjason0312@gmail.com\r\nhttps://www.linkedin.com/in/jasonxie0312/"
    }
  ],
  "open_prs": [],
  "authored_issue_and_pr": []
}