{
  "last_updated": "2024-03-03T17:57:11.000Z",
  "activity": [
    {
      "type": "comment_created",
      "title": "coronasafe/leaderboard#212",
      "time": "2024-03-03T17:57:11.000Z",
      "link": "https://github.com/coronasafe/leaderboard/issues/212#issuecomment-1975245128",
      "text": "Hello @rithviknishad  @khavinshankar @sainak @bodhish @gigincg @Ashesh3  ,\r\n\r\nI'm Prabhat Kumar, an enthusiastic undergraduate in computer science with a strong passion for full-stack development, especially within the MERN stack. I'm genuinely excited about the opportunity to contribute.\r\n\r\n**What interests you most about this project?**\r\n\r\nWhat intrigues me most about this project is its potential to enhance the visibility and recognition of open-source contributors. By incorporating GitHub discussions into the Leaderboard platform, we can provide a more comprehensive representation of contributors' contributions beyond code commits. This project offers an opportunity to delve into the realm of data scraping, GraphQL integration, and user interface design, all while contributing to a tool that promotes transparency and collaboration within the open-source community.\r\n\r\n**As mentors and project coordinators, how can we get the best out of you?**\r\n\r\nTo get the best out of me, I thrive in environments that foster clear communication, constructive feedback, and collaborative problem-solving. Providing detailed guidance on project requirements, expectations, and priorities will help me stay focused and motivated. I value regular check-ins and discussions to ensure alignment and address any challenges that may arise. Additionally, I am always eager to learn and explore new technologies, so opportunities for mentorship and knowledge sharing are highly appreciated.\r\n\r\n**Is there anything that you’ll be studying or working on whilst working alongside us?**\r\n\r\nWhile working on this project, I plan to deepen my understanding of GraphQL and its integration with existing platforms. I will also explore techniques for efficient data scraping and processing to ensure robust and reliable collection of GitHub discussion events. Additionally, I am keen on honing my frontend development skills, particularly in the context of user interface design and user experience optimization.\r\n\r\n**We'd love to hear a bit about your work preferences, e.g. how you keep yourself organized, what tools you use, etc.?**\r\n\r\nI believe in a systematic approach to work and prioritize organization and time management to ensure productivity. I typically utilize project management tools such as Trello or Asana to track tasks, deadlines, and progress. Additionally, communication tools like Slack or Discord are essential for staying connected with team members and mentors. For development, I rely on version control systems like Git for collaboration and code management. I am also proficient in a variety of programming languages and frameworks, including JavaScript, React, and Python, which I anticipate will be valuable for this project.\r\n\r\n**Weekly Schedule with Clear Milestones and Deliverables:**\r\n\r\n**Week 1:**\r\n- Research and familiarize myself with GitHub's GraphQL endpoint and discussion events.\r\n- Set up development environment and tools for data scraping and integration.\r\n- Begin implementing GraphQL queries to retrieve discussion events.\r\n\r\n**Week 2-3:**\r\n- Develop and test data scraping functionality to gather discussion events from GitHub.\r\n- Implement data storage and organization for discussion events within Leaderboard's database.\r\n- Design and prototype UI components for displaying discussion events on the homepage.\r\n\r\n**Week 4:**\r\n- Integrate discussion events into Leaderboard's homepage, showcasing the latest five discussions.\r\n- Implement pagination and navigation for accessing additional discussion events.\r\n- Conduct initial testing and debugging of the discussion feature.\r\n\r\n**Week 5:**\r\n- Fine-tune UI/UX elements for displaying discussion events on the homepage and dedicated pages.\r\n- Implement user profile enhancements to display discussion participation.\r\n- Conduct comprehensive testing and gather feedback for further refinements.\r\n\r\n**Week 6:**\r\n- Finalize any remaining adjustments or enhancements based on feedback.\r\n- Prepare documentation and guidelines for utilizing the discussion feature.\r\n- Submit final project deliverables and present the completed feature to mentors and the community.\r\n\r\nThis proposed schedule outlines a structured approach to project development, with clear milestones and deliverables for each week. It allows for iterative development and testing while ensuring timely progress towards the project goals.\r\n\r\n\r\n"
    },
    {
      "type": "comment_created",
      "title": "coronasafe/care_fe#6715",
      "time": "2024-03-03T17:02:26.000Z",
      "link": "https://github.com/coronasafe/care_fe/issues/6715#issuecomment-1975230868",
      "text": "Hello @nihal467 @rithviknishad  ,\r\n\r\nI'm Prabhat Kumar, an enthusiastic undergraduate in computer science with a strong passion for full-stack development, especially within the MERN stack. Your GSoC 2024 project has captured my interest, and I'm genuinely excited about the opportunity to contribute.\r\n\r\nProject Overview:\r\n\r\nThe project involves integrating TOTP-based 2FA into the authentication process of Open Health Networks. 2FA adds an additional layer of security by requiring users to provide a second factor, in addition to their password, during login. TOTP is a widely adopted 2FA method that generates temporary codes based on a shared secret and current time.\r\n\r\nObjectives:\r\n\r\n1. Integration with Existing Authentication System: Investigate the current authentication system used by Open Health Networks and devise a strategy to seamlessly integrate TOTP-based 2FA without disrupting existing user workflows.\r\n\r\n2. User Interface Design: Develop user-friendly interfaces for enabling and managing 2FA settings within the Open Health Networks platform. This includes designing intuitive setup wizards and authentication prompts.\r\n\r\n3. TOTP Generation and Verification: Implement TOTP generation and verification mechanisms according to the Time-Based One-Time Password Algorithm specified in RFC 6238. Ensure secure storage of user secrets and adherence to best practices in cryptographic security.\r\n\r\n4. Backup and Recovery Mechanisms: Implement backup and recovery mechanisms to facilitate the restoration of access in case users lose their TOTP devices or encounter other authentication challenges.\r\n\r\n5. Documentation and Testing: Document the implementation details, including setup instructions, usage guidelines, and security considerations. Conduct comprehensive testing to ensure the reliability, compatibility, and security of the 2FA implementation across various platforms and devices.\r\n\r\n\r\nDeliverables:\r\n\r\n- Seamless integration of TOTP-based 2FA into Open Health Networks.\r\n- User-friendly interfaces for enabling and managing 2FA settings.\r\n- Secure TOTP generation, verification, and backup mechanisms.\r\n- Comprehensive documentation covering setup, usage, and security considerations.\r\n- Successfully passed tests demonstrating the reliability and effectiveness of the 2FA implementation."
    },
    {
      "type": "comment_created",
      "title": "coronasafe/care_fe#7327",
      "time": "2024-03-03T06:30:26.000Z",
      "link": "https://github.com/coronasafe/care_fe/issues/7327#issuecomment-1975062162",
      "text": "I think it already has drag and drop feature"
    },
    {
      "type": "pr_opened",
      "title": "coronasafe/care_fe#7325",
      "time": "2024-03-02T17:11:15.000Z",
      "link": "https://github.com/coronasafe/care_fe/pull/7325",
      "text": "fix: consistent header across all pages"
    },
    {
      "type": "comment_created",
      "title": "coronasafe/care_fe#7316",
      "time": "2024-03-02T04:24:29.000Z",
      "link": "https://github.com/coronasafe/care_fe/issues/7316#issuecomment-1974284033",
      "text": "Hii @sainak can i work on this issue."
    }
  ],
  "open_prs": [
    {
      "link": "https://github.com/coronasafe/care_fe/pull/7325",
      "title": "fix: consistent header across all pages",
      "stale_for": 1,
      "labels": []
    }
  ],
  "authored_issue_and_pr": []
}